# LoadCaseNature Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadCaseNature Property
ParameterTypeId Class See Also
---
"Nature"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadCaseNature { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadCaseNature As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadCaseNature {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace